[
  {
    "name": "repo",
    "description": "The Github repo that will be used to store comments.\n\nIn order to work correctly, the repo must be public, with the giscus app installed, and \nthe discussions feature must be enabled.\n"
  },
  {
    "name": "repo-id",
    "description": "The Github repository identifier.\n\nYou can quickly find this by using the configuration tool at [https://giscus.app](https://giscus.app).\nIf this is not provided, Quarto will attempt to discover it at render time.\n"
  },
  {
    "name": "category",
    "description": "The discussion category where new discussions will be created. It is recommended \nto use a category with the **Announcements** type so that new discussions \ncan only be created by maintainers and giscus.\n"
  },
  {
    "name": "category-id",
    "description": "The Github category identifier.\n\nYou can quickly find this by using the configuration tool at [https://giscus.app](https://giscus.app).\nIf this is not provided, Quarto will attempt to discover it at render time.\n"
  },
  {
    "name": "mapping",
    "description": "The mapping between the page and the embedded discussion. \n\n- `pathname`: The discussion title contains the page path\n- `url`: The discussion title contains the page url\n- `title`: The discussion title contains the page title\n- `og:title`: The discussion title contains the `og:title` metadata value\n- any other string or number: Any other strings will be passed through verbatim and a discussion title\ncontaining that value will be used. Numbers will be treated\nas a discussion number and automatic discussion creation is not supported.\n"
  },
  {
    "name": "reactions-enabled",
    "description": "Display reactions for the discussion's main post before the comments."
  },
  {
    "name": "loading",
    "description": "Specify `loading: lazy` to defer loading comments until the user scrolls near the comments container."
  },
  {
    "name": "input-position",
    "description": "Place the comment input box above or below the comments."
  },
  {
    "name": "theme",
    "description": "The giscus theme to use when displaying comments."
  },
  {
    "name": "language",
    "description": "The language that should be used when displaying the commenting interface."
  }
]