[
  {
    "name": "id",
    "description": "The id of this listing. When the listing is rendered, it will \nplace the contents into a `div` with this id. If no such `div` is defined on the \npage, a `div` with this id will be created and appended to the end of the page.\n\nIn no `id` is provided for a listing, Quarto will synthesize one when rendering the page.\n"
  },
  {
    "name": "type",
    "description": "The type of listing to create. Choose one of:\n\n- `default`: A blog style list of items\n- `table`: A table of items\n- `grid`: A grid of item cards\n- `custom`: A custom template, provided by the `template` field\n"
  },
  {
    "name": "contents",
    "description": "The files or path globs of Quarto documents or YAML files that should be included in the listing."
  },
  {
    "name": "sort",
    "description": "Sort items in the listing by these fields. The sort key is made up of a \nfield name followed by a direction `asc` or `desc`.\n\nFor example:\n`date asc`\n\nUse `sort:false` to use the unsorted original order of items.\n"
  },
  {
    "name": "max-items",
    "description": "The maximum number of items to include in this listing."
  },
  {
    "name": "page-size",
    "description": "The number of items to display on a page."
  },
  {
    "name": "sort-ui",
    "description": "Shows or hides the sorting control for the listing. To control the \nfields that will be displayed in the sorting control, provide a list\nof field names.\n"
  },
  {
    "name": "filter-ui",
    "description": "Shows or hides the filtering control for the listing. To control the \nfields that will be used to filter the listing, provide a list\nof field names. By default all fields of the listing will be used\nwhen filtering.\n"
  },
  {
    "name": "categories",
    "description": "Display item categories from this listing in the margin of the page.\n\n  - `numbered`: Category list with number of items\n  - `unnumbered`: Category list\n  - `cloud`: Word cloud style categories\n"
  },
  {
    "name": "feed",
    "description": "Create an RSS feed for this page using the items in this listing (see [Feed](#feed)). "
  },
  {
    "name": "date-format",
    "description": "The date format to use when displaying dates (e.g. d-M-yyy). \nLearn more about supported date formatting values [here](https://deno.land/std@0.125.0/datetime).\n"
  },
  {
    "name": "max-description-length",
    "description": "The maximum length (in characters) of the description displayed in the listing.\nDefaults to 175.\n"
  },
  {
    "name": "image-placeholder",
    "description": "The default image to use if an item in the listing doesn't have an image."
  },
  {
    "name": "image-align",
    "description": "In `default` type listings, whether to place the image on the right or left side of the post content (`left` or `right`)."
  },
  {
    "name": "image-height",
    "description": "The height of the image being displayed (a CSS height string).\n\nThe width is automatically determined and the image will fill the rectangle without scaling (cropped to fill).\n"
  },
  {
    "name": "grid-columns",
    "description": "In grid type listings, the number of columns in the grid display.\nDefaults to 3.\n"
  },
  {
    "name": "grid-item-border",
    "description": "In grid type listings, whether to display a border around the item card. Defaults to `true`.\n"
  },
  {
    "name": "grid-item-align",
    "description": "In grid type listings, the alignment of the content within the card (`left` (default), `right`, or `center`).\n"
  },
  {
    "name": "table-striped",
    "description": "In table type listings, display the table rows with alternating background colors.\nDefaults to `false`.\n"
  },
  {
    "name": "table-hover",
    "description": "In table type listings, highlight rows of the table when the user hovers the mouse over them.\nDefaults to false.\n"
  },
  {
    "name": "template",
    "description": "The path to a custom listing template.\n"
  },
  {
    "name": "template-params",
    "description": "Parameters that are passed to the custom template."
  },
  {
    "name": "fields",
    "description": "The list of fields to include in this listing.\n"
  },
  {
    "name": "field-display-names",
    "description": "A mapping that provides display names for specific fields. For example, to display the title column as ‘Report’ in a table listing you would write:\n\n```yaml\nlisting:\n  field-display-names:\n  title: \"Report\"\n```\n"
  },
  {
    "name": "field-types",
    "description": "Provides the date type for the field of a listing item. Unknown fields are treated\nas strings unless a type is provided. Valid types are `date`, `number`.\n"
  },
  {
    "name": "field-links",
    "description": "The list of fields to display as hyperlinks to the source document \nwhen the listing type is a table. By default, only the `title` or \n`filename` is displayed as a link.\n"
  },
  {
    "name": "field-required",
    "description": "Fields that items in this listing must have populated.\nIf a listing is rendered and one more items in this listing \nis missing a required field, an error will occur and the render will.\n"
  },
  {
    "name": "include",
    "description": "Items with matching field values will be included in the listing."
  },
  {
    "name": "exclude",
    "description": "Items with matching field values will be excluded from the listing."
  }
]